docs/k6-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/stroke-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 8 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 8 looping VUs for 1m0s (gracefulStop: 30s)

time="2026-03-31T13:39:51+05:30" level=info msg="Setup complete — room: NB4848" source=console

running (0m01.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 8 VUs  0m00.4s/1m0s

running (0m02.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 8 VUs  0m01.4s/1m0s

running (0m03.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 8 VUs  0m02.4s/1m0s

running (0m04.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 8 VUs  0m03.4s/1m0s

running (0m05.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 8 VUs  0m04.4s/1m0s

running (0m06.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 8 VUs  0m05.4s/1m0s

running (0m07.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  11% ] 8 VUs  0m06.4s/1m0s

running (0m08.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 8 VUs  0m07.4s/1m0s

running (0m09.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  14% ] 8 VUs  0m08.4s/1m0s

running (0m10.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 8 VUs  0m09.4s/1m0s

running (0m11.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 8 VUs  0m10.4s/1m0s

running (0m12.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  19% ] 8 VUs  0m11.4s/1m0s

running (0m13.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  21% ] 8 VUs  0m12.4s/1m0s

running (0m14.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  22% ] 8 VUs  0m13.4s/1m0s

running (0m15.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  24% ] 8 VUs  0m14.4s/1m0s

running (0m16.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  26% ] 8 VUs  0m15.4s/1m0s

running (0m17.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  27% ] 8 VUs  0m16.4s/1m0s

running (0m18.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  29% ] 8 VUs  0m17.4s/1m0s

running (0m19.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  31% ] 8 VUs  0m18.4s/1m0s

running (0m20.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  32% ] 8 VUs  0m19.4s/1m0s

running (0m21.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  34% ] 8 VUs  0m20.4s/1m0s

running (0m22.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  36% ] 8 VUs  0m21.4s/1m0s

running (0m23.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  37% ] 8 VUs  0m22.4s/1m0s

running (0m24.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  39% ] 8 VUs  0m23.4s/1m0s

running (0m25.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  41% ] 8 VUs  0m24.4s/1m0s

running (0m26.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  42% ] 8 VUs  0m25.4s/1m0s

running (0m27.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  44% ] 8 VUs  0m26.4s/1m0s

running (0m28.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  46% ] 8 VUs  0m27.4s/1m0s

running (0m29.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  47% ] 8 VUs  0m28.4s/1m0s

running (0m30.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  49% ] 8 VUs  0m29.4s/1m0s

running (0m31.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  51% ] 8 VUs  0m30.4s/1m0s

running (0m32.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  52% ] 8 VUs  0m31.4s/1m0s

running (0m33.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  54% ] 8 VUs  0m32.4s/1m0s

running (0m34.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  56% ] 8 VUs  0m33.4s/1m0s

running (0m35.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  57% ] 8 VUs  0m34.4s/1m0s

running (0m36.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  59% ] 8 VUs  0m35.4s/1m0s

running (0m37.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  61% ] 8 VUs  0m36.4s/1m0s

running (0m38.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  62% ] 8 VUs  0m37.4s/1m0s

running (0m39.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  64% ] 8 VUs  0m38.4s/1m0s

running (0m40.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  66% ] 8 VUs  0m39.4s/1m0s

running (0m41.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  67% ] 8 VUs  0m40.4s/1m0s

running (0m42.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  69% ] 8 VUs  0m41.4s/1m0s

running (0m43.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  71% ] 8 VUs  0m42.4s/1m0s

running (0m44.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  72% ] 8 VUs  0m43.4s/1m0s

running (0m45.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  74% ] 8 VUs  0m44.4s/1m0s

running (0m46.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  76% ] 8 VUs  0m45.4s/1m0s

running (0m47.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  77% ] 8 VUs  0m46.4s/1m0s

running (0m48.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  79% ] 8 VUs  0m47.4s/1m0s

running (0m49.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  81% ] 8 VUs  0m48.4s/1m0s

running (0m50.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  82% ] 8 VUs  0m49.4s/1m0s

running (0m51.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  84% ] 8 VUs  0m50.4s/1m0s

running (0m52.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  86% ] 8 VUs  0m51.4s/1m0s

running (0m53.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  87% ] 8 VUs  0m52.4s/1m0s

running (0m54.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  89% ] 8 VUs  0m53.4s/1m0s

running (0m55.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  91% ] 8 VUs  0m54.4s/1m0s

running (0m56.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  92% ] 8 VUs  0m55.4s/1m0s

running (0m57.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  94% ] 8 VUs  0m56.4s/1m0s

running (0m58.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  96% ] 8 VUs  0m57.4s/1m0s

running (0m59.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default   [  97% ] 8 VUs  0m58.4s/1m0s

running (1m00.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default   [  99% ] 8 VUs  0m59.4s/1m0s

running (1m01.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m02.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m03.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m04.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m05.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m06.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m07.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m08.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m09.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m10.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m11.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m12.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m13.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m14.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m15.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m16.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m17.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m18.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m19.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m20.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m21.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m22.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m23.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m24.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m25.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m26.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m27.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m28.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m29.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m30.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate < 0.01' rate=0.00%

    stroke_latency_ms
    ✓ 'p(99) < 200' p(99)=1

    ws_connect_errors
    ✓ 'count < 3' count=0


  █ TOTAL RESULTS 

    checks_total.......: 8       0.088345/s
    checks_succeeded...: 100.00% 8 out of 8
    checks_failed......: 0.00%   0 out of 8

    ✓ WS connected

    CUSTOM
    stroke_latency_ms..............: avg=0.174875 min=0       med=0        max=58       p(90)=1        p(95)=1       
    strokes_sent...................: 7188   79.378303/s

    HTTP
    http_req_duration..............: avg=273.89ms min=37.96ms med=273.89ms max=509.82ms p(90)=462.64ms p(95)=486.23ms
      { expected_response:true }...: avg=273.89ms min=37.96ms med=273.89ms max=509.82ms p(90)=462.64ms p(95)=486.23ms
    http_req_failed................: 0.00%  0 out of 2
    http_reqs......................: 2      0.022086/s

    EXECUTION
    iteration_duration.............: avg=58.03s   min=58.03s  med=58.03s   max=58.03s   p(90)=58.03s   p(95)=58.03s  
    iterations.....................: 8      0.088345/s
    vus............................: 8      min=8        max=8
    vus_max........................: 8      min=8        max=8

    NETWORK
    data_received..................: 23 MB  250 kB/s
    data_sent......................: 2.2 MB 24 kB/s

    WEBSOCKET
    ws_connect_errors..............: 0      0/s
    ws_connecting..................: avg=18.28ms  min=13.01ms med=17.63ms  max=26.02ms  p(90)=22.24ms  p(95)=23.33ms 
    ws_msgs_received...............: 57488  634.849734/s
    ws_msgs_sent...................: 7220   79.731685/s
    ws_session_duration............: avg=58.03s   min=58.03s  med=58.03s   max=58.03s   p(90)=58.03s   p(95)=58.03s  
    ws_sessions....................: 16     0.176691/s



running (1m30.6s), 0/8 VUs, 8 complete and 8 interrupted iterations
default ✓ [ 100% ] 8 VUs  1m0s